<a href="https://colab.research.google.com/github/Stesilva16/Eng-de-dados--/blob/main/SQL_DML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#INSERÇÃO DE VALORES COM SQL

INSERT INTO nome_da_tabela (colunas) VALUES (valores)

Ex:

INSERT INTO maes (id_mae, nome, endereco, telefone, dt_nascimento)VALUES (10,'Rosário de Almeida', 'Rua zzz', '(11)9.00000000', '21/06/1994')

PARA INSERÇÃO EM TODAS AS COLUNAS AO MESMO TEMPO, NÃO É NECESSÁRIO INFORMAR AS COLUNAS.

INSERT INTO maes VALUES (10, 'Rosário de Almeida', 'Rua zzz', '(11)9.00000000', '21/06/1994')

PARA INSERIR VÁRIOS REGISTROS AO MESMO TEMPO

INSERT INTO maes VALUES 
(NULL, 'Rosário de Almeida', '', '(11)9.00000000', '21/06/1994'),
(NULL, 'Maria Sena', '', '(11)9.00000000', '21/06/1994'),
(NULL, '', '', '(11)9.00000000', '21/06/1994'),
(NULL, '', '', '(11)9.00000000', '21/06/1994');

In [ ]:
#DELETAR OS DADOS DO BANCO DE DADOS

DELETE FROM nome_da_tabela;

DELETE FROM meus_amigos_instagram;

DELETE FROM nome_da_tabela WHERE id_mae = 4;
DELETE FROM nome_da_tabela WHERE nome = 'Tereza Cristina';
DELETE FROM nome_da_tabela WHERE id_mae = 4 OR id_mae = 5;
DELETE FROM nome_da_tabela WHERE id_mae > 5 AND id_mae < 10;

In [ ]:
#ATUALIZAR OS DADOS DE UMA TABELA

/* ATUALIZAR UMA OU MAIS COLUNAS DE UMA TABELA */

UPDATE nome_da_tabela
SET coluna1 = novo_valor1, coluna2 = novo_valor2, colunaN = novo_valorN
WHERE condição;

UPDATE maes
SET endereco = 'Rua Rouxinol Amarelo'
WHERE id_mae = 4;

UPDATE maes
SET endereco = 'Rua Rouxinol Amarelo', telefone = '(88)9.98988989'
WHERE id_mae = 2;

UPDATE maes SET endereco = 'Rua Rouxinol Amarelo', telefone = '(88)9.98988989' WHERE id_mae = 2;

In [ ]:
#CONSULTA DE DADOS UTILIZANDO SELECT

/*CONSULTAR / LER / READ */

SELECT colunas FROM tabela
SELECT coluna1, coluna2, coluna3, colunaN FROM tabela
SELECT * FROM tabela;

/* Mostrar todos os dados de bebes */
SELECT * FROM bebes
/* Mostrar nome e data de nascimento das mães */
SELECT nome, dt_nasc FROM maes;
/* Mostrar nome, crm e especialidade dos médicos */
SELECT nome, crm, especialidade FROM medicos;
SELECT especialidade, nome, crm FROM medicos;


/* SELECT DISTINCT */

SELECT DISTINCT cidade FROM compras

/* ORDER BY */
SELECT * FROM maes ORDER BY nome ASC;
SELECT * FROM maes ORDER BY nome DESC;

/* MIN e MAX */
SELECT MIN(alt_nasc)
FROM bebes

SELECT MAX(alt_nasc)
FROM bebes

/* COUNT - Retorna Quantidade*/
SELECT COUNT(id_bebe)
FROM bebes
/* SUM - Retorna a Soma*/
SELECT SUM(alt_nasc)
FROM bebes
/* AVG - Retorna a Média Aritmética*/
SELECT AVG(alt_nasc)
FROM bebes

/* LIKE */
SELECT colunas
FROM nome_tabela
WHERE condição LIKE 'algum_padrão'

SELECT *
FROM maes
WHERE nome LIKE 'Maria%'

SELECT *
FROM maes
WHERE nome LIKE '%Maria%'

SELECT *
FROM maes
WHERE nome NOT LIKE '%Mari_%'

SELECT *
FROM maes
WHERE nome LIKE '%Silvi[ao]'

/* APELIDOS - ALIASES */

SELECT nome, endereco, telefone
FROM maes

SELECT nome, dt_nasc AS Data_Nascimento, AVG(alt_nasc) AS media_altura, SUM(peso_nasc) AS soma_peso
FROM bebes AS b

/* BETWEEN */

SELECT nome, peso
FROM bebes
WHERE peso_bebe BETWEEN 3 AND 4

SELECT nome, peso
FROM bebes
WHERE dt_nasc BETWEEN '2021-01-01' AND '2022-11-30'